{
  "id": "240511",
  "type": "niupleis",
  "date": "2024年05月11日",
  "color": "#20f469",
  "title": "ニウプレイス用言語、コリシ",
  "summary": "自分のプロジェクトのためのコンランの開発を始めました。",
  "content": "<p>コンランは「constructed language（構築言語）」の略です。言語は自然に進化しますが、コンランは意図的に一人またはグループによって作成されます。有名なコンランの例にはエルフ語、クリンゴン、ミニオンがあります。最近では、コンランを作成するコミュニティさえあります。コンランは楽しみのために作られますが、一般的には文学、映画、またはビデオゲームなどのコンテキストで創造的要素として使用されます。<br>それが明確になったら、こちらが... コリシ、私のコンランです。<img src='images/240511_korishiAlphabet.webp'> あるいは少なくともコリシのアルファベットです。</p><p>数か月前にコンランコミュニティを知りました。彼らは多くのリソースを共有し、私はコンランを作成するつもりはなかったのですが、コミュニティのコンランを学ぶのが楽しかったです。しかし、その物語は魅力的で、コンランのコンセプトと私が学んだことは常に私の心の奥にありました。私のウェブサイトにはいくつかの秘密があります：曖昧な参照と秘密のコード。始める前にそれを決めました。それはほぼargのように見えるべきです。覚えておいてください。数週間前、ネクロノミコンのコピーにアクセスできました；それは魔道書で非常に興味深いと思いました。私をベスティアリーに思い起こさせました、それは私のお気に入りのファンタジーの本の一部です。数日前、このプロジェクト（シリーズと呼んでいます）を始めました。架空の人種についてのものです；純粋に挿絵です。私はそれを<a href='https://www.instagram.com/p/C6xTCG7RET-/?igsh=MXc1dnNjOWxudWFwcw==' target='_blank'>niupleisのInstagram</a>で共有しています。ともかく、2024年5月10日金曜日の早朝、これらの種に関する「ベスティアリー」を書くことに決めました。後で、大学に到着しようとしていた時、声が聞こえました。「ねえ、なんでベスティアリーをコンランで書かないの？」と。私は図書館に行きました、そこは涼しく静かです（特に金曜日は）。そして作業を始めました。</p><p>私は自分で言語を勉強します。私の意見では、最高のアルファベットの1つはハングル（韓国語）です。音節がどのように構成され、どれだけ早く読めるかによってです。それは私の音節構築の基準ですが、少し良いです。ハングルでは音節ごとに最大4文字を組み合わせることができますが、これらは私にとって最も早く読むのが難しいものなので、私は私のコンランの音節をそれぞれ2文字にすることにしました。それで最終子音はないはずです... でもあるかもしれません？あとで説明します。</p><img src='images/240511_korishiSilabes.webp'><p>ハングルは速く読むことができますが、速く書くことはできません。解決策は簡単です；私は書き方が多いです。実際、私は非常に得意です。初期の学習カーブを乗り越えると、手書きは非常に速くなります。私はもっと速く書けると思います。時々手書きで書くと、次の単語の場所に手があるので、手を動かすために一時停止する必要があります。解決策は古代の韓国語、日本語、中国語にもあります... 縦書き！<br></p><p>さて、アルファベットですが、書かれたページを反時計回りに90度回すと、アルファベットの元ネタが分かります。はい、ほとんど同じ記号を使っていますが、「ほとんど」です。前にもたくさんの醜いものを修正する必要がありました。手書きは読むときに混乱することがあります。書かれたものを確認するには、手書きで「minimum」と書いてください。音素と文字についてもう一つは、スペイン語で「S」と「Z」がどうして同じ音なのかということです。私たちはそれを*同じように発音します。<br></p><p>同じ音素を持つ文字を取り除き、私が好きではない文字を変更しました。たとえば、「𝓊」という文字は今、「𝒾」の記号を使っていますが、点を付けました。そして、「𝓊」の記号は今、「𝓃」と混同しやすいので、「𝓂」のものに変えました。いくつかの音素は同じ記号を共有しますが、横に点が付いています。私は日本語や韓国語のロジックに従って、微妙な変化を使って音声力を表しました。例えば、「ㄱ」と「ㅋ」や、「ひ」と「び」と「ぴ」などです。</p><p>さらに、単音節の母音や複数の子音、または最終子音を書くための無音記号（「h」、「ㅇ」、「ー」など）も追加しました。これに関連して、次の部分です。</p><img src='images/240511_korishiCharacters.webp'><p>今、私のコンランの最もユニークな機能について話します。部屋の中の象ですね。スペイン語はアクセント（または音節の強勢）が重要な言語ですが、中国語ではピッチが重要です。私のコンランではこれら2つを望んでいるので、音楽記号を実装することにしました。これにより、スペイン語のように単語やフレーズの間の一時的な停止を避けたり、複合音節のためにワイルドカードを他の音節と結びつけたり、強勢を間隔の形で適用したり、イントネーションをメゾ、フォルテ、クレッシェンドなどの形で適用したりできます。</p><img src='images/240511_korishiMusic.webp'><p>これは複雑さを増すかもしれませんが、正直、私はこの方法が好きです。このコンランは、その設計から多目的で、ノーミーズから自分を守ります。インターミディエーティングで紙上でも良く見えます；私はそれを2人に見せましたが、彼らは花のつるに似ていると言いました。</p><p>最後に、いくつかのことを練り直すかもしれませんが、これは単なるアルファベットです。語彙、文法、構文を書いていきます。とにかく、このコンランをいずれアップデートし、おそらくすぐにそのベスティアリーについてのブログを書くでしょう。<br><big>さようなら！</big></p>"
}