{
  "id": "240824",
	"type": "dev",
	"langs": "[한국어][日本語][ESP][ENG]",
	"color": "#0baaf9",
	"date": "24 de Agosto de 2024",
	"title": "Stellario - Devlog 0",
	"summary": "El comienzo del desarrollo de mi primer juego.",
	"content": "<p>Hola soy tanuki. Soy artista, músico, desarrollador y estoy a cargo de niupleis.com, estoy desarrollando un videojuego arcade del tipo matamarcianos, como space invaders o galaga.</p><img src='images/240824_spaceInvaders.webp' style='display:inline;'><img src='images/240824_galaga.jpg' style='display:inline; margin-left: 10px;'><p>Este último es de hecho mi inspiración para crear este juego.<br>El mio se vé así:</p><img id='stellarioScreenShoot' src='images/240824_stellarioScreenShoot.webp'><p>Está obviamente en una etapa muy temprana.<br>Como sea.</p><p>Decidí hacer un videojuego cuando leí <a href='#pythonLibro'>este libro</a>, es un tutorial para construir algunos videojuegos y en la página 69, ahí dice \"matamarcianos\", leí el capitulo y me llamó la atención, porque recordé a galaga (lo jugué mucho de niño), me dije, bueno, hagamoslo... Pero me niego a programar un juego con python XD</p><img id='pythonLibro' src='images/240824_pythonLibro.webp' style='display:inline;'><img src='images/240824_pythonLibro-69.webp' style='display:inline;'><p>En realidad tengo varios proyectos de videojuegos pero son proyectos para estudiar desarrollo pero este, este si lo quiero terminar, y <a href='#stellarioScreenShoot'>así está quedando.</a></p><p>Pero no veremos que está ocurriendo aquí ahora, mejor veremos mi GDD, es muy sencillo.</p><img src='images/240824_stellarioGdd.jpg' style='display:inline;'><img src='images/240824_stellarioGdd2.jpg' style='display:inline;'><p>Este juego tiene historia, pero la historia está en tu cara, no te cuento un lore super intricado complejo, lo que pasa en el juego es todo lo que pasa, la historia está dividida en 8 partes y cada parte es un nivel en el juego. Cada nivel tendrá sus armas y enemigos.</p><img src='images/240824_stellarioConcept.jpg' style='display:inline;'><img src='images/240824_stellarioConcept2.jpg' style='display:inline;'><p>Y pienso que cada nivel sea único, con ambientación diferente y canciónes de fondo diferentes.</p><p>Pero para eso tengo que ponerme a desarrollar...<br>Actualizaré sobre eso aquí. Adios!!!</p>"
}