{
  "id" : "231203",
  "type" : "niupleis",
  "date" : "12/03/2023",
  "color" : "#f42069",
  "title" : "''Under Construction''",
  "summary" : "Update on niupleis.com",
  "content" : "<p>In a recent post, I created this character that's supposed to be on the main page of <a href='http://www.niupleis.com'>niupleis.com</a> while it's under construction because the old page wasn't very attractive.</p><img src='images/maitoChan_wwwOriginal.webp'><p>I explained the design and mentioned that I would create a special illustration. Well, I did it!</p><p>I followed my usual process: thought of a pose and composition, sketched, outlined, colored, and rendered it in my style.</p><img src='images/pagEnConst_workflowDeIlustracion_drk.webp'><p>It's a png with no background. Originally, I wanted the webpage to serve as the background, but I changed my mind a bit and created a wallpaper with HTML code to add a meta touch to the web context. I wrote the HTML, justified it to 9:16 aspect ratio, took a screenshot, used a special brush to color the text, and added a gradient from the edges to blend it with the page.</p><img src='images/pagEnConst_workflowDeWallpaper.webp'><p>It looked great, but I didn't want to use the text from the old page. I had to be more creative since I had the illustration and the background. The idea I had was quite obvious: the character with a speech bubble saying 'Under Construction'. Originally, there were 4 texts in 4 languages, but I didn't want to use 4 speech bubbles, so I decided to use a gif that would change languages every 2 or 3 seconds.</p><img src='images/pagEnConst_textoAGlobo.webp'><img src='images/pagEnConst_gifDeTextos.webp'><p>Finally, I put everything together, struggled with CSS to make it look nice, left a link to the blog, and it was ready to go live.</p><img src='images/pagEnConst_gifFinal.webp'><p>Now I have to do all of this again for error pages and whatever else is needed on the website (@_@)<br>In the meantime, you can see the illustration in action <a href='http://www.niupleis.com'>here↗</a><br>Well, goodbye!!!</p>"
}
