{
  "id": "240628",
  "type": "niupleis",
  "date": "June 28, 2024",
  "color": "#f420ff",
  "title": "Niupleis has Competition",
  "summary": "Competition: Hybe's Virtual Group",
  "content": "<p>This morning I went on YouTube and came across a video from a K-pop gossip channel. The video caught my attention because the title and thumbnail already had interesting information.<br>This was the video:</p><iframe width='681' height='383' src='https://www.youtube.com/embed/C8ujgrvHw7c' title='HYBE'S NEW VIRTUAL GROUP GENERATES DISGUST FOR ITS OBSESSION WITH AESPA' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe><p>It turns out that HYBE, in their desperate attempt to recover from the fiasco with ADORE and the controversies with ILLIT, NewJeans & AESPA, decided to debut a virtual unit, but it went wrong because as soon as it was announced, it became the target of criticism, and rightly so.</p><p>• One of the members steals Karina's name from AESPA and is called Kanari.<br>• One member is a man but seems to be American because he demands the members call him unnie. The before and after images of the \"transition\" don't match. I say \"transition\" because it seems that HYBE doesn't clarify the member's sexuality at all. In their defense, maybe they'll clarify it in the future; for this reason, people say it's a homophobic group.<br>• The official designs were presented in 'turn-around' format and are criticized because the members have exaggeratedly drawn butts like characters from Miraculous, except for the male member, who has a differently drawn crotch. I'm not sure why that's controversial, but anyway.</p><p>However, this isn't why the news interested me. The reason is simpler. I'm making my own virtual group.</p><img src='images/240628_ps.jpg' alt='Screenshot of niupleis.com (coming soon)'><p>My most ambitious project for niupleis.com, with the power of Blender, FL-studio, Medibang, VoiceBanks, and Lucifer, I will form the female idol group: Punk Suteki.<br>Now you understand my interest? It's my perfect opportunity to compete and win, and if HYBE continues doing what they've been doing for the past few years, they won't even be competition. And you've already seen a member,<a href='?id=240423'>In this other blog.</a></p><p>The launch of niupleis.com is near. The page is finished, and only the illustrations are left, but I'm already on it.<br>We'll see what happens. Goodbye!</p>"
}