{
  "id": "240609",
  "type": "blog",
  "date": "06 09 2024",
  "color": "#ff1133",
  "title": "No to niches, yes to comfort",
  "summary": "A small content experiment on YouTube",
  "content": "<p>For the past two months, I've been uploading videos to YouTube. I've uploaded 2 videos with similar content but different formats: one edited and the other unedited. I can't compare their performance because they aren't viewed, but I can compare my experience making them.<br>The edited video had to be rushed. While making the drawings for the video, I had to worry about getting everything right in the recording, and then I had to spend a couple of hours editing. The unedited video was simply hitting record and talking. The editing only required me to cut the beginning and end of the clip and clean up the sound, which took no more than 15 minutes.<br>This is also interesting. The first video is boring, there is no voice or anything interesting happening, it's predictable. I tried using descriptive subtitles to fix the problem of being boring, but it's silly. Reading a script or explaining the video I already made feels wrong and uncomfortable. In the second video, I was able to speak and explain myself better, it feels more personal. So yes, I prefer that.<br></p><p>I know I need to experiment more, so I will try to be more consistent. In fact, I've been trying something new which is part of the latest video. There's text showing the date and time on the lower border of the recording. This is purely an artistic decision to mimic the aesthetic VHS recordings, and it also adds transparency to the recording.</p><p style='color:#aaa;'>Edited video</p><iframe width='640' height='360' src='https://www.youtube.com/embed/coTUtSjsGpk' title='Drawing line-art icons (time lapse)' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe><p style='color:#aaa;'>Unedited video</p><iframe width='640' height='360' src='https://www.youtube.com/embed/P3wFybeeDMA' title='the future of music | vlog' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe><p>Anyway, please subscribe to the channel.<br>Goodbye!!!</p>"
}