{
    "id" : "240722",
    "type" : "blog",
    "langs" : "[한국어][日本語][ESP][ENG]",
    "date": "July 22, 2024",
    "color": "#fee12b",
    "title": "Post in the Storm",
    "summary": "What I've been up to these days",
    "content": "<p>There is a thunderstorm right now. They are rare in this place; it's normally dry and hot here. \"I hate it here!\"</p> <p>Anyway, last night I had insomnia (as I always do), and I thought of something I wanted to do for a long time. I wrote a script to post on this blog from the terminal. It's something I needed because I usually created the files manually from my IDE, had to write the entire HTML practically, and then format it to JSON. But now, I just write in the terminal and the script does the rest for me. This is the first post I'm using my script for. I wrote it in bash, by the way.</p> <p>I've been working on the drawings for niupleis.com, which is why I haven't posted here or on YouTube or X, but I've already finished 4 drawings. Tomorrow, I'll share screenshots here if I can.<br>What the heck! I'll do it now.</p> <p>These are the 4 illustrations I finished. They are actually about the project I talked about in this other blog:<a href=\"?id=240628\">Niupleis has competition</a>.</p> <img src=\"images/240722_ilustraciones.jpg\"></img> <p>These illustrations will be on niupleis.com/PunkSuteki/</p> <p>Besides that, I've been working on other projects that I haven't discussed here or on YouTube. I plan to update on YouTube and finally make the niupleis.com site public in August or September, at least before this blog turns one year old. Anyway.</p> <p>I forgot to mention that there's a disadvantage to posting with this script, which is that there are no simultaneous translations when posting. Before, it was possible because I did it manually. I want to implement an API, but that will take time. In the meantime, I've configured the main page to show the languages available for each post.</p> <p>That's all for now. I'll try to come back soon. Goodbye!!!</p>"
}