{
  "id": "240824",
	"type": "dev",
	"langs": "[한국어][日本語][ESP][ENG]",
	"color": "#0baaf9",
	"date": "August 23, 2024",
  "title": "Stellario - Devlog 0",
  "summary": "The beginning of the development of my first game.",
  "content": "<p>Hi, I'm Tanuki. I'm an artist, musician, developer, and I'm in charge of niupleis.com. I'm developing an arcade shooter game like Space Invaders or Galaga.</p><img src='images/240824_spaceInvaders.webp' style='display:inline;'><img src='images/240824_galaga.jpg' style='display:inline; margin-left: 10px;'><p>Galaga is actually my inspiration for creating this game.<br>Mine looks like this:</p><img id='stellarioScreenShoot' src='images/240824_stellarioScreenShoot.webp'><p>It's obviously in a very early stage.<br>Anyway.</p><p>I decided to make a video game after reading <a href='#pythonLibro'>this book</a>. It's a tutorial on building some video games, and on page 69, it says \"shooter.\" I read the chapter, and it caught my attention because it reminded me of Galaga (I played it a lot as a kid). I thought, well, let's do it... But I refuse to code a game in Python XD</p><img id='pythonLibro' src='images/240824_pythonLibro.webp' style='display:inline;'><img src='images/240824_pythonLibro-69.webp' style='display:inline;'><p>I actually have several game projects, but they're mostly for studying development. However, this one, I really want to finish, and <a href='#stellarioScreenShoot'>this is how it's going.</a></p><p>But we're not going to look at what's happening now; instead, let's check out my GDD. It's pretty simple.</p><img src='images/240824_stellarioGdd.jpg' style='display:inline;'><img src='images/240824_stellarioGdd2.jpg' style='display:inline;'><p>This game has a story, but it's right in your face. I'm not telling you some super intricate, complex lore. What happens in the game is all that happens. The story is divided into 8 parts, and each part is a level in the game. Each level will have its own weapons and enemies.</p><img src='images/240824_stellarioConcept.jpg' style='display:inline;'><img src='images/240824_stellarioConcept2.jpg' style='display:inline;'><p>And I want each level to be unique, with different settings and different background music.</p><p>But to do that, I need to get developing...<br>I'll update you on that here. Bye!!!</p>"
}