{
	"id": "240929",
	"type": "dev",
	"langs": "[한국어][日本語][ESP][ENG]",
	"color": "#ff822e",
	"date": "September 29, 2024",
  "title": "Stellario - Devlog 1",
  "summary": "First Stellario demo",
  "content": "<p>Previous devlog: <a href=\"https://blog.niupleis.com/entries/entry.html?id=240824\">Stellario - Devlog 0</a></p><p>This is devlog 1 where we’ll see how I reached this demo stage.</p><img src=\"images/240929_stellarioDemoGameplay.webp\"><p>My goal is something like a shoot 'em up, meaning I need a spaceship and enemies, some levels, different ships and weapons, bosses, and a story...<br>In the previous devlog, I only had some test elements, and the only one I kept in this demo was the spaceship.</p><p>It’s a good start. The next thing was an enemy. I also added two projectiles, one for the ship and one for the enemy.</p><img src=\"images/240929_shipAndEnemy.jpg\"><p>I also assigned them both a \"Health\" value, the ability to take damage. This gave both of them the capacity to die and the ability to kill.</p><img src=\"images/240929_murderSnippet.jpg\"><p>I added a game over screen, a win screen, and a start screen.</p><img src=\"images/240929_screens.jpg\"><p>As you can see, it's the most basic of basics, but it already feels like a game. The ship moves, the enemies attack, and there’s a sense of challenge, even though it's very simple. There’s still a lot to do, but this is already a solid starting point.</p><img src=\"images/240929_gameplay1.webp\"><img src=\"images/240929_gameplay2.webp\"><p>Now that I have this base, I can start iterating and adding the things that will really make Stellario stand out: The waifus, the bosses, the special weapons, and the story I want to tell. But for now, this is what I’ve got. In the next devlogs, we’ll see how I add new elements and mechanics, and how I continue shaping this project. I also want to share some of the challenges I face as an indie developer, because not everything is as easy as it seems.</p><p>By the way, although the game is intended for mobile, this demo is available for testing on PC. You can download it <a href=\"https://niupleis.com/Stellario\" target=\"_blank\">here</a>.</p><p>Thanks for reading, see you soon!</p>"
}