{
    "id": "240414",
    "type": "youtube",
    "langs" : "[한국어] [日本語] [ESP] [ENG]",
    "date": "04 14 2024",
    "color": "#ea7600",
    "title": "Bringing My Characters to Life",
    "summary": "I've set out to learn Blender to animate my OCs and document it on YouTube.",
    "content": "<p>I have original characters that I haven't made public for several reasons. One reason is how challenging it is to make them appealing (in terms of content).</p><p><span style='color: #ff0;'>Spoiler</span>: they are idol apprentices who are part of the niupleis project. I've created panels and illustrations about them, but I never share them because I don't feel they're sufficient.</p><p>I've considered the best formats for these characters, and animation is the most suitable. While I can do hand-drawn animations perfectly, they are very complex and time-consuming. I'd like to reserve them for special occasions.</p><p>3D has always felt alien to me; an extra dimension is intimidating. Learning it will be worthwhile in the long run.</p><p>Like every polymath in 2024 trying to learn a new technology, I went to Google and searched for what was necessary to create 3D anime-style animations. After the disappointment of finding only TikToks and paywalls, I decided to turn to the oracle, <span style='color: #74AA9C;'>Chat-GPT</span>. My prompt was: <code>'write a detailed roadmap to learn Blender, my goal is to make anime-style animations'</code>. The result of my query was (in summary): <code>'Modeling → Texturing → Rendering → Rigging → Controls → Animation → Simulations → Post-production → Style'</code></p><p>In reality, I've been doing modeling since last year, and in recent weeks, I've been trying to do rigs. Rigs are difficult to grasp, but I feel I'm about to overcome that initial phase of ignorance. I have no idea about controls, animations, texturing, and I'm unsure about shaders. I've studied computer graphics and made shaders for Minecraft in the past, so maybe that phase will be easier for me. I'm not very interested in simulations; I just want to apply physics to <span style='animation: superText 1s infinite linear;'>the breasts and buttocks</span> 🗿. Post-production and style will be a surprise for now.</p><p>Finally, I'll document the process in video. I've decided to upload videos to YouTube, and I've just started recently.</p><iframe width='640' height='360' src='https://www.youtube.com/embed/pjW49Loupaw?si=45y4Nf1XGS0Z6XB0' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe>"
}