{
  "id": "240511",
  "type": "niupleis",
  "langs" : "[한국어] [日本語] [ESP] [ENG]",
  "date": "05 11 2024",
  "color": "#20f469",
  "title": "korishi, the Language for Niupleis",
  "summary": "I started developing a conlang for my projects.",
  "content": "<p>A conlang is short for 'constructed language.' Languages naturally evolve over time, but a conlang is deliberately created by a person or group of people. Famous examples of conlangs include Elvish, Klingon, and Minion. Nowadays, there are even communities dedicated to creating conlangs. While conlangs are made for fun, they are typically used as creative elements in contexts like literature, film, or video games.<br>Now that's clear, meet... korishi, my conlang. <img src='images/240511_korishiAlphabet.webp'> Or at least the korishi alphabet.</p><p>A few months ago, I discovered the conlang community. They shared many resources, and I never intended to create a conlang; I simply enjoyed learning about the community's conlangs. However, the stories were fascinating, and the concept of conlangs and what I learned was always in the back of my mind. My website has some secrets: obscure references and secret codes. I decided on that before even starting; it should almost seem like an arg, remember that. A few weeks ago, I got access to a copy of the Necronomicon; it's a grimoire and I found it very interesting. It reminded me of a bestiary, which are some of my favorite fantasy books. A few days ago, I started this project (I call it a 'series') about fictional human species; it's purely illustrative. I'm sharing it on <a href='https://www.instagram.com/p/C6xTCG7RET-/?igsh=MXc1dnNjOWxudWFwcw==' target='_blank'>niupleis' Instagram</a>. Anyway, on Friday, May 10, 2024, in the early morning, I decided I would write a 'bestiary' about these species. Later, as I was about to reach the university, I heard a voice say 'hey, why not write the bestiary in a conlang.' I went to the library, which is cool and quiet (even more on Fridays), and got to work.</p><p>I study languages on my own; in my opinion, one of the best alphabets is Hangul (Korean), because of how syllables are constructed and how quickly it can be read. That's my reference for syllable construction, but a bit better. In Hangul, you can combine up to 4 letters in a syllable, and these are precisely the most difficult for me to read quickly, so I'm only leaving the syllables of my conlang with 2 letters each, so there can't be final consonants... or can there? I'll explain later how.</p><img src='images/240511_korishiSilabes.webp'><p>Hangul is read quickly but not written quickly, and the solution is easy; I write a lot in cursive, in fact, I'm very good at it. After the initial learning curve, you can write in cursive very quickly, and I know I can go faster. Sometimes when I write in cursive, I have to pause to move my hand because I'm right-handed and my hand is perpetually where the next word goes. The solution is also in ancient Korean, Japanese, and Chinese... Vertical writing!<br></p><p>Now, the alphabet; just turn the written page 90° counterclockwise to see where I got the alphabet from. Yes, it uses almost all the same symbols, 'almost' because I had to fix many ugly things about the alphabet before. Cursive writing is sometimes confusing when reading; just write 'minimum' in cursive to check it. Another thing is phonemes and letters. How is it that in Spanish, we have 'S' & 'Z'? We pronounce them the *same.<br></p><p>I removed letters with identical phonemes, and I changed some letters that I don't like, such as '𝓊' now using the symbol for '𝒾' but with a dot, and the symbol for '𝓊' now being that of '𝓂' because it's easy to confuse with '𝓃'. Some phonemes share the same symbol but have a dot on the side; I followed the logic of Japanese and Korean in using subtle changes for phonetic force, for example, 'ㄱ' & 'ㅋ' or 'ひ', 'び' & 'ぴ'.</p><p>I also added wildcard symbols (like 'h', 'ㅇ' & 'ー') that are silent for when I want to write singular vowels or multiple consonants or final consonants. In relation to this, the next part.</p><img src='images/240511_korishiCharacters.webp'><p>Now I'll talk about the most unique feature of my conlang; the elephant in the room. Spanish is a language where accent (or syllable stress) is important, in Chinese, pitch is important. I want these two things for my conlang, so I came up with something, implementing musical notation. This way, I can apply ligatures to words or phrases to avoid pauses between words like in spoken Spanish or link wildcards with other syllables for compound syllables, accents in the form of intervals, and intonation in the form of mezzo, forte, crescendos, etc.</p><img src='images/240511_korishiMusic.webp'><p>I am aware that this adds complexity, but honestly I like it more this way, this conlang, from its coception concepción, is versatile, it gatekeeps itself from the normies, It's intimidating and looks good on paper; I have shown it to a couple of people and they say that it looks like a flower vine. To finish, maybe I will refine some things, this is just the alphabet, I will write vocabulary, syntax and grammar. Anyway, I'll update this conlang eventually and maybe write a blog about that bestiary soon<br><big>Bye!</big></p>"
}