{
  "id": "240703",
  "type": "gaming",
  "langs" : "[한국어] [日本語] [ESP] [ENG]",
  "date": "July 2, 2024",
  "color": "#8cf739",
  "title": "What if I Play Geometry Dash",
  "summary": "If I start a gaming channel, I'll play Geometry Dash",
  "content": "<p>I've been playing Geometry Dash since 2016, just before the 2.1 update came out, although I stopped playing at some point in 2021 while waiting for the 2.2 update. Now that 2.2 has been released, I wanted to return. I used to be very active in the community and even had a channel where I uploaded levels I completed, but the wait was too long, so I got tired.<br>Now with my YouTube channel, I've been thinking about maybe uploading GD content, but I think it would be a better idea to do it on a different channel because the channel I already have is about other things, not GD.</p><img src='images/240703_perfilDeGd.png'><p>I've had an idea about the content. You see, Geometry Dash stays alive because of the levels created by the community; millions of levels have been published. The most interesting ones are those that are 'rated' and reward you for completing them, and the rewards are better or worse depending on the type of level and its difficulty.<br>Another interesting part of the game is its competitive side: there is a player ranking system based on each player's statistics. My rank is currently 149123 as shown in the image above; that is my profile and my statistics. Another part of the competitive side is when players compete to complete a level first, or in the least time, or with the fewest attempts, or simply to complete extremely difficult levels.</p><p>It's a game without an objective; the objective is set by the player. Now that this is clear, back to my content idea. My idea is this...</p><img src='images/240703_nivelesOnlineGD.png'><p>There are over 42500 levels, and I've completed 1300, so there are more than 41000 rated levels for me to discover. Completing these levels has benefits as a player. I've thought I could sit for a couple of hours playing levels, edit these longplays into more digestible video segments, and upload them to YouTube. And this could serve as a record of the levels I complete and, why not, content.<br>This is not an original idea, really; it is inspired by the style of videos uploaded by YouTuber PangaeaPanga, @PangaTAS on YouTube. He streams playing Mario Maker 2 and uploads 20-minute videos daily to YouTube.</p><p>This is just an idea. I should test it to see if it works, and if it does... See you on YouTube.</p>"
}