{
  "id": "240814",
  "type": "blog",
  "langs": "[한국어][日本語][ESP][ENG]",
  "color": "#0563fa",
  "date": "August 14, 2024",
  "title": "Back to School = No Procrastination",
  "summary": "I've gone back to school and surprisingly I'm working harder",
  "content": "<p>This Monday, classes started. I'm in the loop of: Wake up early → Study → Work on my projects in my free time → Go back home → Work on my projects → Go to bed early.<br>It's strange because my loop during vacation was: Wake up early → Convince myself to work on my projects → Procrastinate → Go to bed late doom-scrolling.</p><p>I have a lot of free time at university. I go to the library, and nothing distracts me. The internet is good, there's air conditioning, it's quiet, there are thousands of books, no distractions.<br>I really enjoy the time there. I started posting stories on <a href='https://www.instagram.com/niupleis'>my Instagram</a>; I put on YouTube videos or music and work on my computer. I can stay there for hours, focus, and make progress on my projects.</p><p>I've mainly been working on one of my games. I might post about it soon or make a video for YouTube. I've also been solving something for a client, which distracted me a bit but is now finished. I'm planning another development project. I shouldn't, as it will take time, but it's for a greater good, I swear. I haven’t really touched on Punk Suteki, tnkii, and niupleis.com lately, but I commit to doing so tomorrow. I need to get other things in order that I’ve mentioned in other posts, and when I do, oh boy, we’re going to take off.</p><p>Anyway, I need to catch up on some things. The vacation was depressing, so I want to regain some morale now. I feel like I'm on the right track. In the meantime, keep up with <a href='https://www.instagram.com/niupleis'>my Instagram</a>, <a href='https://x.com/ido1_wannabe'>my Twitter</a>, and <a href='https://youtube.com/@idol_wannabe'>my YouTube</a> because I plan to update there soon.<br>Bye!!!</p>"
}