{
	"id": "241028",
	"type": "blog",
	"langs": "[한국어][日本語][ESP][ENG]",
	"color": "#ff66c7",
	"date": "October 29, 2024",
	"title": "Boots and Spikes",
	"summary": "A bit about my life",
	"content": "<p>In the last blog, I wrote <i>‘I’ve never enjoyed life on this planet’</i>. I won’t say it’s a lie, but it’s certainly not accurate; this year, I’ve started <i>‘following my dreams’</i> through something called free will.</p><p>Anyway, something that’s made this easier is that I didn’t have concrete dreams until I started chasing them. As I progress, I understand a lot about myself, which allowed me to set my principles. I’m not saying I now have complete clarity on what to do with my life—far from it. This is just the beginning, but I feel it’s a solid start.</p><p>The problem is that understanding doesn’t come for free. Mistakes, doubts, and your environment can demotivate you, but the trick is not to give up; courage is stronger than motivation and discipline.</p><p>I’ve spent a few years with a broken heart, which is strange because no flowers grow in this garden, but that doesn’t stop or change me. You see, I love girls; they’re my curse. No flower grows here.</p><p>I have to admit, I’m a little worried that I might just be a fool with toxic optimism and that by the time I realize I’m wrong, it’ll be too late. But there’s only one way to find out, and it’s not by sitting around waiting for an answer.</p><p>Speaking of sitting around, I’ve been working out. I was extremely skinny a few years ago, but I’ve solved my eating issues and stayed consistent with my physical training. Fortunately, I’ve noticed improvements, which have positively affected my self-confidence. Maybe I’ll share my workout routine sometime.</p><p>I’ve been experimenting with my personal expression and found a style I like, based on a few things: <b>Boots and Spikes</b>. Look at Michael Jackson in the <a href=\"https://youtu.be/dsUXAEzaC3Q\">Bad music video</a>.</p><p>On a similar note, I’ve created a personal Instagram. I wanted to use Niupleis’s Instagram for myself, but that wouldn’t be professional, so I made a personal IG instead: <a href=\"https://www.instagram.com/iimsobadbad\">@iimsobadbad</a>. I chose the username from ITZY’s ‘Wannabe’ lyrics, aligning with my taste for ‘Bad’ as I mentioned before and my YouTube name ‘Idol <b>Wannabe</b>.’ I’m not exactly sure what I’ll do on IG yet, but I’ll figure it out.</p><p>I need to focus on what matters and get to work; I don’t have time to waste anymore.</p><p>Until next time.<br>Goodbye!</p>"
}