{
  "id" : "231123",
  "type" : "waifu",
  "date" : "23 11 23",
  "color" : "#ff50ff",
  "title" : "Maito-Chan",
  "summary" : "Creando Un Personaje Original",
  "content" : "<h4>Contexto</h4><p>Este blog es un subdominio de <a href='http://www.niupleis.com'>niupleis.com</a> esa pagina es un proyecto mas grande que aun estoy desarrollando, por lo que lo único que se puede ver allí es el mensaje 'En Construcción' y un <a href='https://es.wikipedia.org/wiki/Arte_ASCII'>dot Art.</a><br><img class='small' src='images/maitoChan_wwwOriginal.webp'><br>No está mal, pero podría ser mejor, tener una solucion más creativa al problema de tener una página vacia; despues de todo, ¿no es de eso de lo que se trata el proyecto niupleis?<br>Hice una breve lluvia de ideas. No puedo poner musica, no es una sala de espera. Una animacion es demasiado. Un juego es una locura. Una ilustracion, tiene todo el sentido del mundo, pero ¿una ilustración de qué?, de una chica de anime, ¡dime más!, una chica que esta construyendo la página, tiene un martillo, un casco de contructor, equipo de trabajo... Oye! son muchos detalles, no habrás creado un nuevo<a href='https://en.wiktionary.org/wiki/original_character'>oc</a>por accidente...<br>Esto pasó hace algunos dias cuando estaba subiendo la primera entrada de estd blog y descubrí que necesitaba poner algo en el subdo 'www.' así que hice un html con el mensaje y el dotart a prisas, de allí surgió la idea y la serie de eventos que ocacionaron la creación de Maito-chan.<br></p><h4>Boceto</h4><p>Empece a dibujar un boceto, hice una figura femenina con proporciones del estilo anime, los brazos en una pose de flexionar los biceps, una mano en puño y la otra sosteniendo un mazo, cuando terminé de dibujar los pies empece a dibujar su ropa, primero unas botas, luego unos shorts cortos y un tank corto. Para el estilo anime es importante la forma del cabello, primero le dibujé un bob, me gustó pero es muy generico así que añadí mechones como coletas a los costados. En su rostro puse dos ojos grandes y expresivos, la boca y naríz son solo un par de lineas.<br><img src='images/maitoChan_sketch.gif'><br>Enseguida empecé a dibujar elementos mas especificos al concepto de Maito-chan, primero puse un casco al que luego añadí orejas de gato como detalle, buena desición, se convitió en mi parte favorita del diseño. Luego añadí un chaleco de seguridad, completé las botas y también la forma del mazo. Así quedó listo mi boceto.<br><img class='small' src='images/maitoChan_sketch.webp'></p><h4>Dibujo</h4><p>Me gusta mucho delinear, mis pinceles y técnica hacen delinear una tarea divertida, bocetar es la parte dificil así que no hay razón por la que pueda salir mal un delineado. Mi delineado fué mas o menos fiel al boceto,las diferencias mas notables son la forma del mazo y todo el delineado de las botas.<br><img src='images/maitoChan_lineart.gif'><br>Otra diferencia esta en el casco, hice la franja qeu tiene en medio un poco mas ancha, quería poner la 'M' de Maito-chan pero no quiero que me hagan un<a href='https://es.wikipedia.org/wiki/Cese_y_desista'>nintendo</a>asi que mejor puse un corazón.<br><img src='images/maitoChan_lineart.webp'><br></p><p>No hace falta renderizar mucho para una referencia (me dio flojera), Para la piel elgí un tono de piel amarillento, para el cabello un rosa brillante y desaturado, se supone que los shorts sean denim así que simplemente puse un azul marino verdoso, el casco tenía que ser amarillo-naranja obviamente y el chaleco naranja más oscuro con franjas verdes llamativas (literlamente #00ff00) Las botas negras y calcetas blancas. Esos son mis colores planos.<br><img class='small' src='images/maitoChan_color.webp'><br>Finalmente añadí sombras, del tipo lineal no volumetricas, le llaman<a href='https://es.wikipedia.org/wiki/Sombreado_plano_(animaci%C3%B3n)'>cel shading</a>. Y rendericé un poco los ojos.<br><img class='small' src='images/maitoChan_render.webp'><br></p><p>El proceso fué tan divertido que lo hice otra vez, en realidad dupliqué el dibujo y modifiqué el lineart y los colores, pero solamente en los shorts y el chaleco, prácticamente me deshice de ellos, el chaleco lo cambié por el tank corto que hice antes y el short dejó de ser denim, también cambié de color las calcetas.<br><img class='small' src='images/maitoChan_lineartB.webp'><img class='small' src='images/maitoChan_colorB.webp'><img class='small' src='images/maitoChan_renderB.webp'><br>Hice un fondo simple y ¡está listo!<br><img src='images/maitoChan_final.webp'><br></p><h4>Fin</h4><p> Guardé varias versiones, para compartir. Todo lo visto en este blog me ha tomado casi 2 dias, si bien el diseño está listo, aún no esta lista la aplicación para la página en construcción, quiero hacer una ilustración bien pensada para eso, ademas puedo usar a Maito-chan para más páginas, como la del error 404, 403, 502, redirecciónes, etc. Pero me encargaré de eso despues y actualizare en otro blog. Por ahora declaro completo el diseño de Maito-chan, Bye!<br><img src='images/maitoChan_altA.webp'><br><img src='images/maitoChan_altB.webp'></p>"
}