{
  "id" : "231203",
  "type" : "niupleis",
  "date" : "03 12 2023",
  "color" : "#f42069",
  "title" : "''en construcción''",
  "summary" : "Actualización en niupleis.com",
  "content" : "<p>En un reciente entrada creé este personaje que se supone estar en la página principal de<a href='http://www.niupleis.com'>niupleis.com</a> mientras esta en construcción, porque la pagina que tenía no era muy bella,</p><img src='images/maitoChan_wwwOriginal.webp'><p>Expliqué el diseño y escribí que haría una ilustración especial. Bueno. Ya lo hice!</p><p>Hice lo usual, pensé en una pose y composición, hice bocetos, delineé, coloreé y rendericé a mi estilo.</p><img src='images/pagEnConst_workflowDeIlustracion_drk.webp'><p>Es un png al que no le dibujé fondo, quería que la página fuera el fondo, pero cambié de opinion un poco, hice un wallpaper con coigo html para que fuera un poco meta en el contexto de la web, primero escribí el html, lo justifique a 9:16 y tomé captura, usé un pincel especial para colorear el texto y un degradado desde los bordes para que se mezcle con la página y lo metí a la web.</p><img src='images/pagEnConst_workflowDeWallpaper.webp'><p>Estaba muy bien pero no iba a usar los textos de la página antigua, tenía que ser más creativo ya que tengo la ilustración y el fondo. La idea que tuve fué muy obvia, el personaje con un globo de texto en el cual dice 'Página en construcción'. Originalmente eran 4 textos en 4 idiomas, pero no iba a poner 4 globos de texto así que decidí poner un gif que fuera cambiando de idiomas cada 2 o 3 segundos</p><img src='images/pagEnConst_textoAGlobo.webp'><img src='images/pagEnConst_gifDeTextos.webp'><p>Finalmente puse todo junto, peliandome con css para que quedara bonito, dejé el enlace al blog y estaba listo para subir</p><img src='images/pagEnConst_gifFinal.webp'><p>Ahora debo hacer todo esto otra vez para paginas de error y lo que haga falta en la web (@_@)<br>Mientras tanto puedes ver la ilustración en acción<a href='http://www.niupleis.com'>aquí↗</a><br>Weno, adios!!!</p>"
}