{
    "id" : "240414",
    "type" : "youtube",
    "date" : "14 04 2024",
    "color" : "#ea7600",
    "title" : "Voy a dar vida a mis personajes",
    "summary" : "Me he propuesto a aprender blender para animar mis OCs y documentarlo en youTube",
    "content" : "<p>Tengo personajes originales que no he hecho públicos por varias razones, una razón es lo complicado que es hacerlos atractivos (en cuanto a contenido).</p><p><span style='color: #ff0;'>Spoiler</span> son aprendices de idols que son parte del proyecto niupleis, he hecho paneles e ilustraciones sobre ellas pero nunca los comparto porque no me parecen suficientes.</p><p>He pensado en el tipo de contenido que serian mejores formatos para estos personajes, y el mejor de esos formatos es animación, puedo perfectamente hacer animaciones an mano, el problema es que las animaciones son muy complicadas, requieren mucho tiempo y atención, y me gustaría reservarlas para ocaciones especiales.</p><p>El 3d me ha sido alien desde siempre, una dimensión extra es intimidante; Aprenderlo valdrá la pena a largo plazo.</p><p>Como todo polímata del año 2024 tratando de aprender una nueva tecnología, fuí a google y busqué lo que era necesario para hacer aimaciones 3d de estilo anime, después de la decepción de encontrar solo tiktoks y pay walls decidí rendirme y consultar al oraculo, <span style='color: #74AA9C;'>Chat-GPT</span>. Mi prompt fué: <code>'escribe un roadmap detallado para aprender blender, mi meta es hacer animaciones de estilo anime'</code>, el resultado de mi consulta fué (en resumen): <code>'Modelado → Texturizado → Renderizado → Rigging → Controles → Animación → Simulaciónes → Postproducción → Estilo'</code></p><p>En realidad he hecho modelado desde el año pasado, y estas últimas semanas he intentado hacer rigs, los rigs son complicados de entender pero siento que estoy por superar esa fazze inicial de ignorancia. Sobre controles, aimaciones, texturizado no tengo ni idea, y de shaders no sé que pensar, he estudiado gráficos de computadore y hice shaders para minecraft en el pasado así que quizás esa faze sea más facil para mí. Las simulaciónes no me interezan demasiado, solo quiero aplicar fisicas a <span style='animation: superText 1s infinite linear;'>las tetas y las pompas</span> 🗿. La postproducción y el estilo serán una sorpresa por ahora.</p><p>Finalmente, documentaré el proceso en video, he decidido subir videos a youtube y he empezado hace poco.</p><iframe width='640' height='360' src='https://www.youtube.com/embed/pjW49Loupaw?si=45y4Nf1XGS0Z6XB0' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe>"
}