{
  "id" : "240511",
  "type" : "niupleis",
  "date" : "11 05 2024",
  "color" : "#20f469",
  "title" : "Korishi, el idioma para niupleis",
  "summary" : "Empece el desarrollo de un conlang para mis proyectos",
  "content" : "<p>Un conlang es una abreviatura de 'constructed language' (idioma construido), los idiomas surgen naturalmente a lo largo del tiempo pero un conlang es creado deliberadamente por una persona o un grupo de personas, ejemplos famosos de conlangs serian el élfico, el klingon y el minion, en esta época incluso hay comunidades dedicadas a la creación de conlangs. Sí se hacen conlangs por diversion pero normalmente se usan como elementos creativos en contextoos como la literatura, cine o videojuegos.<br>Ya que eso está claro, conozcan... Corihsi mi conlang.<img src='images/240511_korishiAlphabet.webp'> O almenos el afabeto de korishi</p><p>Hace unos meses conocí la comunidad conlang, compartían muchos recursos, nunca tuve la intención de hacer un conlang, solamente me gustaba vonocesr los conlangs de la comunidad, pero las historias eran interesantes, el concepto de conlang y lo que aprrendí estaba siempre en el fondo de mi mente. Mi página web tiene algunos secretos: referencias oscuras y códigos secetos, decidí que fuera así desde antes de empezar, casi que pareciese un arg, recordad eso. Hace unas semanas tuve acceso a una copia del Necronomicón, es un grimorio y me pareció muy interesante, me recordaba a un bestiario los cuales son de mis libros de fantasía favoritos, hace unos dias empece este proyecto (yo le llamo 'serie') que va sobre especies ficticias de humanos, es un proyecto meramente ilustrativo; lo estoy compartiendo en el <a href='https://www.instagram.com/p/C6xTCG7RET-/?igsh=MXc1dnNjOWxudWFwcw=='>instagram de niupleis</a>, como sea, el dia viernes 10 de mayo de 2024 en la madrugada decidí que escribiría un 'bestiario' sobre estas especies, más tarde, cuando estaba por llegar a la universidad escuché una voz que dijo 'oye, porqué no escribo el bestiario en un conlang', me fuí a la biblioteca que es fresca y  silenciosa (más en viernes) y me puse manos a la obra.</p><p>Yo estudio idiomas por mi cuenta; en mi opinion uno de los mejores alfabetos es el Hangul (coreano), por como se construyen las sílabas y porque se puede leér muy rápido, esa es mi referencia de construcción de silbas, pero un poco mejor, en el Hangul puedes juntar hasta 4 letras en una sílaba y estas son justament las más dificiles de leer rápido para mí así que yo solo voy a dejar las sílabas de mi conlang con 2 letras cada una, así que no pueden haber consonantes finales... ¿o si? más adelante explico cómo.</p><img src='images/240511_korishiSilabes.webp'><p>El Hangul se leé rápido pero no se escribe rápido, y la solución es fácil; yo escribo mucho en cursivo, de hecho soy muy bueno, despues de la curva de aprendizaje inicial se puede escribir en cursivo muy rápido, y sé que puedo ir más rápido, a veces cuando escribo cursivo tengo que pausar para mover mi mano porque soy diestro y mi mano está perpetuamente en donde vá la siguiente palabra, la solución está tambien en el coreano (antiguo), en el Japonés y en el Chino... ¡La escritura Vertical!<br></p><p>Ahora sí, el alfabeto, solo hay que girar la página escrita 90° en sentido anti horario para saber de donde saqué el alfabeto, sí, usa casi todos los mismos símbolos, 'casi' porque tuve que arreglar muchas cosas feas sobre el alfabeto antes, la escritura cursiva es a veces consufa al momento de leer, solo hace falta escribir 'minimo' en cursivo para comprobarlo, otra cosa son los fonemas y letras, ¿Cómo es que en español tenemos 'S' & 'Z'? las pronunciamos *igual.<br></p><p>Quité las letras de fonemas iguales, y cambié algunas letras que no me gustan que son algunos:La letra '𝓊' ahora usa el simbolo de la '𝒾' pero son el punto, y el mibolo de la '𝓊' ahora es eel de la '𝓂' porque es facil de confundir con el de la '𝓃', algunos fonemas comparten el mismo simbolo pero tienen un puntoa un lado, seguí la lógica del Japonés y Coreano de usar cambios sutiles por fuerza de fonemas por ejemplo 'ㄱ' & 'ㅋ' ó 'ひ', 'び' & 'ぴ'.</p><p>También agregué simbolos comodines (como 'h', 'ㅇ' & 'ー') que son silenciosos para cuando quiera escribir vocales en singular o varias consonantes o consonantes finales, y en relación a esto la siguiente parte.</p><img src='images/240511_korishiCharacters.webp'><p>Ahora hablaré de la característica más única de mi conlang; el elfante en la habitación. El español es un idioma donde el acénto (o estrés de sílabas) es importante, en el Chino el pitch es importante, yo quiero estas dos cosas para mi conlang, así que se me ocurrió hacer algo, implementar la notación musical, y así puedo aplicar ligaduras a palabras o frases para evitar pausas entre palabras como en el español hablado, o ligar comodines con otras sílabas para silabas compuestas, acentos en forma de intervalos y entonación en forma de mezo, forte, crescendos, etc.</p><img src='images/240511_korishiMusic.webp'><p>Soy conciente de que esto agrega complejidad pero honestamente lo prefiero así, este conlang, desde su concepción, es versátil, es facil de mantener como nicho libre de normies, esintimidante y se vé bién en papel; se lo he mostrado a un par de personas que dicen que parece una enredadera de flores.</p><p>Para terminar, quizás refine algunas cosas, además esto es solo el alfabeto, ya iré escribiendo vocabulario, sintaxis y gramática. Como sea, actualizaré sobre este conlang eventualmente y quizás escriba un blog sobre aquel bestiario pronto<br><big>Adios!</big></p>"
}