{
  "id" : "240609",
  "type" : "youtube",
  "date" : "09 06 2024",
  "color" : "#ff1133",
  "title" : "Nichos no, comodidad sí",
  "summary" : "Un pequeño experimento de contenido en youtube",
  "content" : "<p>Desde hace dos meses empecé a subir videos a youtube, he subido 2 videos similares en contenido pero diferentes en formato: uno editado y otro a cámara abierta, no puedo comparar la performance porque no son vistos pero sí puedo comparar mi experiencia haciendolos.<br>el vídeo editado tubo que ser rusheado, mientras hacía los dibujos que salen en el video me tenía que preocupar de que saliera todo bién en la grabación y después tuve que dedicar un par de horas a la edición. El video a cámara abierta simplemente fué darle a grabar y hablar, la edición solo necesito de mí que cortara el inicio y el final del clip y limpiar el sonido, no me tomóo más de 15 minutos.<br>Esa también es una cosa interesante, en el primero es aburrido, no hay voz ni nada interesante pasando, es predecible, traté de usar subtitulos descriptivos para intentar arreglar un poco el problema de ser aburrido pero es tonto, leer un guión o explicar el video que ya hice se siente incorrecto e incomodo, en el segundo en cambio, si pude hablar y explicarme mejor, se siente más personal. Así que sí prefiero eso.<br></p><p>Sé que tengo que experimentar más, así que voy a tratar de ser más constante. De hecho he estado probando una cosita que es parte del último video, hay un texto qu mestra la fecha y hora en el border inferior de la grabación, esto es una desición puramente artistica para hacer como hacian las grabaciones aesthetic vhs, y además tiene añade transparencia a la grabación.</p><p style='color:#aaa;'>Video editado</p><iframe width='640' height='360' src='https://www.youtube.com/embed/coTUtSjsGpk' title='Dibujando line-art de icons (time lapse)' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe><p style='color:#aaa;'>Video a cámara abierta</p><iframe width='640' height='360' src='https://www.youtube.com/embed/P3wFybeeDMA' title='el futuro de la música | vlog' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe><p>Como sea, suscribanse al canal por favor.<br>Adios!!!</p>"
}