{
  "id" : "240628",
  "type" : "niupleis",
  "date" : "28 06 2024",
  "color" : "#f420ff",
  "title" : "Niupleis tiene competencia",
  "summary" : "Competencia: El grupo virtual de Hybe",
  "content" : "<p>Esta mañana entré a youtube y me topé con un video de un canal de chismes de k-pop, el video me llamó la atención por que en el título y la miniatura había información ya interesante de por sí.<br>Éste era el video:</p><iframe width='681' height='383' src='https://www.youtube.com/embed/C8ujgrvHw7c' title='EL NUEVO GRUPO VIRTUAL DE HYBE GENERA DISGUSTO POR SU  OBSESION CON AESPA' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share' referrerpolicy='strict-origin-when-cross-origin' allowfullscreen></iframe><p>Resulta que HYBE en su desesperado intento de recuperarse de todo el fiasco que tuvieron con ADORE y las controversias con ILLIT, NewJeans & AESPA, vienen y deciden que quieren debutar una unidad virtual, pero les sale mal porque apenas se anuncian y ya son blanco de críticas y con razón.</p><p>• Una de las miembros roba y espaghetiza el nombre de Karina de AESPA y la llaman Kanari.<br>• Una miembro es un hombre pero ha de ser gringo porque exige a las miembros que la llamen unnie, las imagenes de antes y deespues de la \"transición\" no concuerdan. Digo \"transición\" porque parece que hybe no aclara la sexualidad de la miembro para nada, en su defensa puedo decir que quizás lo aclaren en el futuro; Por esta misma razón la gente dice que es un grupo homofobico.<br>• Los diseños oficiales se presentaron en formato 'turn-around' y son criticados porque las miembros tienen dibujado el culo como si fueran personajes de miraculous, a escepción de el miembro hombre porque le dibujaron la entrepierna deferente. No estoy seguro porque eso es controversial pero bueno.</p><p>Como sea, eso no es la razón por la que me interesó a mí esta noticia, la razón es más sencilla. Yo estoy haciendo mi propio grupo virtual.</p><img src='images/240628_ps.jpg' alt='Captura de niupleis.com (próximamente)'><p>Mi proyecto más ambicioso para niupleis.com, con el poder de Blender, FL-studio, Medibang, VoiceBanks y Lucifer formaré el grupo de idols femeninas: Punk Suteki.<br>¿Ahora entienden mi interés? Es mi oportunidad perfecta para competir y ganar, y si Hybe sigue haciedo lo que ha hecho desde hace un par de años, pues ni siquiera serán competencia. Y ustedes ya han visto una miembro,<a href='?id=240423'>En este otro blog.</a></p><p>La salida de niupleis.com ya está próxima, la página está terminada y solo faltan las ilustraciones, pero ya estoy en eso.<br>Ya veremos que pasa, Adios!</p>"
}