{
  "id" : "240703",
  "type" : "gaming",
  "date" : "02 07 2024",
  "color" : "#8cf739",
  "title" : "Y si juego Geometry Dash",
  "summary" : "Si me hago un canal de gaming jugaré Geometry Dash",
  "content" : "<p>Juego GeometryDash desde 2016, poco antes de que saliera la actualización 2.1, aunque por esperar la 2.2 dejé de jugar en algún punto de 2021.Y ahora que ha salido la 2.2 he querido regresar, yo solía ser muy activo en la comunidad, incluso tuve un canal donde subia niveles que me pasaba, pero la espera fué muy larga así que me cansé.<br>Ahora con mi canal de yt he pensado en quizás subir contenido de GD, pero creo que sería una mejor idea hacerlo en un canal diferente porque el canal que ya tengo es sobre otras cosas, no sobre GD.</p><img src='images/240703_perfilDeGd.png'><p>He tenido una idea sobre el contenido, verás, Geometry Dash se mantiene vivo por los niveles que crea la comunidad; Se han publicado millones de niveles, los más interesantes son los que están \"clasificados\" y recompensan por completarlos y las recompensas son mejores o peores dependiendo del tipo de nivel y su dificultad.<br>Otra parte ineresante del juego es su lado competitivo: En el juego hay un sistema de clasificasión de jugadores basado en las estadisticas de cada jugador, mi rango es actualmente 149123 como se muestra en la imagen de arriba; ese es mi perfil y mis estadisticas. Otra parte del competitivo es cuando los jugardores compiten por completar un nivel antes, o en menor tiempo, o en menos intentos, o simplemente completar niveles de dificultad extrema.</p><p>Es un juego sin objetivo, el objetivo lo pone uno como jugador, ya que eso está claro vuelvo a mi idea de contenido, mi idea es está...</p><img src='images/240703_nivelesOnlineGD.png'><p>Hay +42500 niveles y he completado 1300 así que hay más de 41000 niveles que tienen clasificación para que yo descubra, completar estos niveles tiene beneficios como jugador, he pensado que podria sentarme un par de horas a jugar niveles, editar estos longplay en segmentos de video más digeribles y subirlos a youtube. Y eso puede servir como archivo de los niveles que completo y, porque no, contenido.<br>Esta no es una idea original en realidad, es inspirado por el estilo de videos que sube el youtuber PangaeaPanga, @PangaTAS en youtube. Él hace directos jugando Mario Maker 2 y sube diariamente videos de 20 minutos a YouTube.</p><p>Esto es solo una idea, devería ponerla a prueba pra ver si funciona, y si lo hace pues... Nos vemos en YouTube.</p>"
}