{
	"id": "241027",
	"type": "niupleis",
	"langs": "[한국어][日本語][ESP][ENG]",
	"color": "#ce032c",
	"date": "27 de Octubre de 2024",
	"title": "Fin del hiatus (◎‿○)",
	"summary": "Lo qué he hecho este més sin actividad",
	"content": "<p>Holii compañeros...<br>Nunca he disfrutado la vida en este planeta.</p><p>Como sea, ha pasado un més sin actividad y voy a actualizar lo que he estado haciendo.</p><b style=\"color: #ce032c; font-size: 28px;\">Sobre niupleis.com</b><p>He retrasado mucho la página por varias razones. Hace 2 méses cambié el hosting a uno más accesible. El contenido de la mayoría de las páginas es muy poco para considerar que valga la pena publicarlas tán pronto. He estado añadiendo nuevas secciones y no he terminado ninguna. Conforme aprendo más sobre diseño web he mejorado mucho las páginas.</p><p>No creo que sea posible tener la página principal lista para antes de que este blog cumpla un año como quería.</p><b style=\"color: #ce032c; font-size: 28px;\">Sobre desarrollo de juegos</b><p>He mejorado mis motores y herramientas, debería agilizar mi proceso de desarrollo pero en realidad casí no he estado desarrollando por falta de tiempo. Quizás esto tarde más.</p><b style=\"color: #ce032c; font-size: 28px;\">Sobre YouTube</b><p>No he producido videos, tengo un nuevo microfono y cámara pero no he tenido tiempo de probarlos y tampoco tengo ideas para videos así que no sé que hacer con eso.</p><b style=\"color: #ce032c; font-size: 28px;\">Sobre otros proyectos creativos</b><p>Un super héroe que no es un cuck, una marca de ropa que vale la pena, un grupo de música basado en principios estéticos, un lenguaje para dioses, un culto a la bellesa, 70 multi cuentas, el nuevo rey del pop.<br> Muchas ideas, pocas acciones, sorry.</p><b style=\"color: #ce032c; font-size: 28px;\">Sobre las waifus</b><p>Un anuncio importante pronto... spoiler:</p><img src=\"images/241027_waifuSpoiler.jpg\"><b style=\"color: #ce032c; font-size: 28px;\">Sobre la vida</b><p>En el blog de mañana: <a href=\"?id=241028\">Botas y pinchos</a></p>"
}