{
	"id": "241028",
	"type": "blog",
	"langs": "[한국어][日本語][ESP][ENG]",
	"color": "#ff66c7",
	"date": "29 de Octubre de 2024",
	"title": "Botas y pinchos",
	"summary": "Un poco de mi vida",
	"content": "<p>En el blog anterior escribí <i>Nunca he disfrutado la vida en este planeta</i>. No diré que es una mentira pero ciertamente no es preciso, este año he empezado a <i>\"seguir mis sueños\"</i> a través de una actividad llamada libre albedrío.</p><p>Como sea, algo que me lo ha puesto facil es no haber tenido sueños concretos hasta que los empecé a perseguír, conforme avance en el camino entendí muchas cosas sobre mi, lo cual me permitió establecer mis principios. No estoy diciemdo que ahora tengo certeza de que hacer con mi vida, eso esta muy lejos de la verdad, de hecho esto apenas empieza pero sé que es un comienso sólido.</p><p>El problema es que uno no entiende las cosas gratuita mente, los errores, las dudas y tu ambiente te pueden desmotivar pero el truco esta en no rendirse, el corage es mas poderoso que la motivación y la diciplina.</p><p>He vivido unos años con el corazón destrozado, cosa extraña pues en este jardín no crecen flores, pero eso no me para ni me cambia, verán, me encantan las chicas, son mi maldición. Aquí no hay flor que crezca.</p><p>Debo admitir que estoy un poco preocupado, de que solo sea un tonto con un optimismo tóxico y que cuando me dé cuenta de que estaba equivocado, sea entonces demasiado tarde. Pero solo hay una manera de averiguarlo, y no es quedarse sentado esperando por una respuesta.</p><p>Ya que menciono el tema de quedarse sentado, me he estado ejercitando. Yo era extremadamente delgado hace unos años, pero he solucionado mis problemas alimenticios, y he sido concistente en mi entrenamiento físico, afortunadamemte he notado las mejoras y han afectado positivamente mi autoconfianza, quizás comparta mi rutina de ejercicios en algún momento.</p><p>He estado experimentando con mi expresión personal, he encontrado un estilo que me gusta, basado en un par de cosas: <b>Botas y Pinchos</b>, mirad a Michael Jackson en el <a href=\"https://youtu.be/dsUXAEzaC3Q\">video musical de Bad</a>.</p><p>Casi en la misma nota, me he creado un instagram personal, quería usar el instagram de Niupleis para mí pero no sería profesional, así que mejor me hice un ig personal: <a href=\"https://www.instagram.com/iimsobadbad\">@iimsobadbad</a>. El username lo elegí a partir de la letra de Wannab de Itzy, combina con mi gusto por Bad como mencioné antes y con mi nombre en youtube \"Idol <b>Wannabe</b>\", no sé muy bién que hacer en ig pero ya lo averiguaré.</p><p>Necesito concentrarme en lo que importa y ponerme a trabajar, ya no tengo tiempo que perder.</p><p>Hasta la próxima. <br>Adios!</p>"
}