{
  "displayName": "Niupleis Blog",
  "text_delCookies": "DELETE COOKIES",
  "bio": "Biography <a onclick='toggleBio()'>✕</a>",
  "text_bio": "Here, many things are shared. I mainly document the things I learn, but also other interests and hobbies I have.<br><br>I am an illustrator, focused on anime style. I compose and produce music, although I don't have any songs published yet. I am learning piano and violin.<br><br>I am a programmer; I develop my own tools and am learning game development. The craziest thing I do is study languages. My first language is Spanish, I study Japanese, Korean, and Chinese, and I can speak English.<br><br>Other things I do: I take photographs of the sky, analyze pop music, browse the internet, plan to make YouTube videos, and share fanart on Twitter. I 'plan' but don't go try-hard because social media hasn't worked for me, so I made this blog instead. Let's not even talk about TikTok.<br><br>I also have specific tastes. I watch anime and some animated series, read history and philosophy books, and occasionally European literature. I like Dubstep music, pre-2010s pop, J-pop, C-pop, and music related to anime, but I mainly listen to Vocaloid and K-Pop.<br><br>I am a university student, but I also self-study. I study subjects related to my interests and some exact sciences: Mathematics, Physics, Astronomy, and Computer Science.",
  "text_wellcome": "Hey, welcome to my blog!",
  "all": "all",
  "news": "news",
  "waifu": "waifu",
  "art": "art",
  "dev": "development",
  "gaming": "gaming",

  "text_cookieInfo": "Cookies are used to save language settings",
  "text_rejectCookie": "REJECT",
  "text_acceptCookie": "ACCEPT",
  "text_cookiesInfo": "More information",
  "text_infoCookies": "Two cookies named \"lang\" & \"cookiesEnabled\" are stored.<br>If you accept by mistake or want to delete the cookies, you can click <span style='color:#f42069;'>DELETE COOKIES</span> in the language menu or use the commands <code>delCookie('lang')</code> & <code>delCookie('cookiesEnabled')</code> respectively in your browser console",
  "text_cookiesInfoNt": "CLOSE"
}