{
    "displayName" : "blog de niupleis",
    "archivo" : "archivo",
    "cookies1" : "Se utilizan cookies para guardar configuración de idioma y filtros",
    "cookies2" : "//nombre de la cookie 'lang', codigo de idioma y guardar por 7 dias<br>setCookie('lang', '??', 7)<br>//nombre de la cookie 'filter', id de filtro y guardar por 1 dias<br>setCookie('filter', '????', 1)<br>",
    "langDisclaimer" : "Las traducciones son hechas usando Chat-GPT.",
    "bio" : "Biografía",
    "bio2" : "Aquí se comparten muchas cosas, principalmente documento las cosas que aprendo pero también otras cosas y hobbies que tengo.<br><br>Soy ilustrador, centrado en el estilo de anime. Conpongo y produzco música aunque de momento no tengo cancionespúblicadas, soy aprendíz de piano y violín.<br><br>Soy programador, programo mis propias herramientas y estoy aprendiendo desarrollo de videojuegos. Lo más loco que hago es estudiar idiomas, mi primer idioma es el español, estudio Japonés, Coreano y Chino,y puedo hablar inglés.<br><br>Otras cosas que hago, hago fotografías al cielo, analizo música pop, navego internet, planeo hacer videos parayoutube y compartir fanarts en twitter, 'planeo' pero no voy try hard porque las redes sociales no me han servido,por eso me hice este blog, de tiktok ni hablamos.<br><br>También tengo gustos especificos, veo anime y algunas series animadas, leo libros de historia y de filosofíay algunas pocas veces de literatura europea, me gusta la música Dubstep, pop de antes de los 2010, j-pop y c-pop, ytambién musica que tiene que ver con anime, pero principalmente escucho Vocaloid y K-Pop.<br><br>Soy estudiante universitario pero también estudio por mi cuenta, estudio materias que tienen que ver con misintereses y algunas ciencias exactas: Matemáticas, Física, Astronomía y Ciencia de computadoras.",
    "wellcome" : "Hey, bienvenido a mi blog!",
    "all" : "todo",
    "news" : "novedades",
    "waifu" : "waifu",
    "art" : "arte",
    "dev" : "desarrollo",
    "gaming" : "gaming"
}