{
  "id": "240511",
  "type": "niupleis",
  "date": "2024년 05월 11일",
  "color": "#20f469",
  "title": "korishi, 니우플레이스를 위한 언어",
  "summary": "나는 내 프로젝트를 위한 conlang을 개발하기 시작했다.",
  "content": "<p>Conlang은 'constructed language(건설 언어)'의 약어입니다. 언어는 자연스럽게 시간이 지나면 발전하지만, conlang은 의도적으로 한 사람이나 그룹에 의해 만들어집니다. 유명한 conlang 예시로는 엘프어, 클링곤, 미니언이 있습니다. 요즘에는 conlang을 만드는 커뮤니티도 있습니다. conlang은 즐거움을 위해 만들어지지만 주로 문학, 영화 또는 비디오 게임과 같은 맥락에서 창의적 요소로 사용됩니다.<br>이제 그게 명확하네요, 만나보세요... korishi, 나의 conlang. <img src='images/240511_korishiAlphabet.webp'> 또는 적어도 korishi 알파벳입니다.</p><p>몇 달 전에 conlang 커뮤니티를 알게 되었습니다. 그들은 많은 자료를 공유했고, conlang을 만들 계획은 없었지만 커뮤니티의 conlang을 배우는 것을 즐겼습니다. 그러나 이야기들은 매력적이었고, conlang의 개념과 배운 것은 항상 제 마음 속에 있었습니다. 제 웹사이트에는 몇 가지 비밀이 있습니다: 애매한 참조 및 비밀 코드들. 시작하기 전에 그렇게 결정했습니다; 거의 arg처럼 보이도록 해야 합니다. 몇 주 전에 네크로노미콘의 사본에 접근할 수 있었습니다; 그것은 그리모어이며 매우 흥미로웠습니다. 그것은 나를 베스티어리를 연상시켰습니다, 그것들은 내가 가장 좋아하는 판타지 책 중 일부입니다. 며칠 전, 나는 이 프로젝트(시리즈라고 부르고 있습니다)를 시작했습니다; 이것은 순수하게 삽화적인 것입니다. 저는 <a href='https://www.instagram.com/p/C6xTCG7RET-/?igsh=MXc1dnNjOWxudWFwcw==' target='_blank'>niupleis' Instagram</a>에서 공유하고 있습니다. 아무튼, 2024년 5월 10일 금요일 새벽에, 나는 이 종족들에 대한 'bestiary'를 쓸 것이라고 결정했습니다. 나중에 대학에 도착할 즈음에 '안녕, 왜 bestiary를 conlang으로 쓰지 않아'라는 목소리가 들렸습니다. 도서관에 가서, 그곳은 시원하고 조용합니다(특히 금요일에는 더 그렇습니다), 그리고 일을 시작했습니다.</p><p>저는 스스로 언어를 공부합니다; 내 의견으로는 한글(한국어)이 최고의 알파벳 중 하나입니다. 왜냐하면 음절이 어떻게 구성되고 얼마나 빨리 읽히는지에 따라서입니다. 그것은 제 음절 구성의 참조점이지만 좀 더 나은 것입니다. 한글에서는 음절당 최대 4개의 문자를 결합할 수 있으며, 이것들은 내게 가장 빨리 읽기 어려운 것들이기 때문에, 나는 내 conlang의 음절을 각각 2개의 문자로 만들기로 결정했습니다. 그래서 마지막 자음이 될 수 없습니다... 아닐까요? 나중에 그에 대해 설명하겠습니다.</p><img src='images/240511_korishiSilabes.webp'><p>한글은 빨리 읽히지만 빨리 쓰지는 않습니다. 해결책은 쉽습니다; 나는 서체로 많이 쓰는데, 사실 꽤 능숙합니다. 초기 학습 곡선 이후에는 서체로 아주 빨리 쓸 수 있으며, 나는 더 빠를 수 있다는 것을 알고 있습니다. 가끔 서체로 쓸 때 다음 단어가 위치한 곳에 항상 손이 있어서 손을 움직이기 위해 일시적으로 멈춰야 할 때가 있습니다. 해결책은 고대 한국어, 일본어 및 중국어에도 있습니다... 세로쓰기!<br></p><p>이제 알파벳; 적혀진 페이지를 반시계방향으로 90도 돌리면 알파벳이 어디에서 온 것인지 알 수 있습니다. 네, 거의 동일한 기호를 모두 사용합니다, '거의'라는 말은 전에 많은 추악한 것들을 수정해야 했기 때문입니다. 서체로 쓰기는 때로 읽기가 어려울 수 있습니다; 'minimum'을 서체로 써보면 확인할 수 있습니다. 또 다른 것은 음소와 문자입니다. 스페인어에서 'S'와 'Z'가 어떻게 같은 소리인지 알 수 있습니까? 우리는 *같은 방식으로 발음합니다.<br></p><p>같은 음소를 가진 문자들을 제거하고, '𝓊'라는 문자는 '𝒾'의 기호를 사용하지만 점을 찍은 것으로 바꿨으며, '𝓊'의 기호는 이제 '𝓃'과 혼동하기 쉬운 것이기 때문에 '𝓂'의 기호로 변경했습니다. 일부 음소는 동일한 기호를 공유하지만 측면에 점을 찍었습니다; 일본어와 한국어의 음성력을 따르면서 사소한 변화를 주었습니다. 예를 들어 'ㄱ'과 'ㅋ' 또는 'ひ', 'び' 및 'ぴ'입니다.</p><p>또한 단독 모음이나 다중 자음 또는 종성 자음을 쓸 때 사용되는 카드 문자('h', 'ㅇ', 'ー'와 같은)도 추가했습니다. 이와 관련하여 다음 부분입니다.</p><img src='images/240511_korishiCharacters.webp'><p>이제 내 conlang의 가장 독특한 기능에 대해 이야기하겠습니다; 방 안의 코끼리. 스페인어는 강세(또는 음절 악센트)가 중요한 언어이며, 중국어에서는 음높이가 중요합니다. 내 conlang에는 이 두 가지를 원하기 때문에 음악 표기법을 도입하기로 했습니다. 이렇게 하면 발음하는 스페인어처럼 단어나 구문 사이의 일시적인 정지를 피하거나, 복합 음절을 위해 와일드카드를 다른 음절에 연결하거나, 간격의 형태로 강세를 적용하거나, 음조의 형태로 메종, 포르테, 크레센도 등을 적용할 수 있습니다.</p><img src='images/240511_korishiMusic.webp'><p>이것이 복잡성을 더하는 것을 인지하지만 솔직히 이 방법이 더 좋습니다, 이 conlang은 그 설계로부터 다채로우며, 일반인들로부터 자체적으로 방어되어 있습니다. intimidating하고 종이에서도 잘 보이는데, 제가 둘이에게 보여준 바로는 꽃 덩굴과 같다고 말했습니다.</p><p>마무리로, 몇 가지를 정제할지도 모르겠고, 이것은 단지 알파벳일 뿐이며, 어휘, 문법, 그리고 구문을 쓸 것입니다. 어쨌든, 나중에 conlang을 업데이트하고 아마도 곧 bestiary에 대한 블로그를 쓸지도 모르겠습니다.<br><big>잘가!</big></p>"
}