{
  "id": "240814",
  "type": "blog",
  "langs": "[한국어][日本語][ESP][ENG]",
  "color": "#0563fa",
  "date": "14 de Agosto de 2024",
  "title": "Vuelta a clases = Sin procrastinar",
  "summary": "He vuelto a clases y sorprendentemente estoy trabajando más duro",
  "content": "<p>Este lunes empezaron las clases, estoy en el loop de: Despertarse temprano → Estudiar → Trabajar en mis proyectos en las horas libres → Volver a casa → Trabajar en mis proyectos → Dormir temprano.<br>Cosa extraña porque mi loop en vacaciones era: Levantarme temprano → Convencerme de trabajar en mis proyectos → Procrastinar → Dormir tarde haciendo doom-scroll.</p><p>Tengo muchas horas libres en la universidad, me voy a la biblioteca y no hay nada que me saque. El internet es bueno, hay aire acondicionado, hay silecio, hay miles de libros, no hay distracciones.<br>Disfruto mucho el tiempo allí, empecé a subir historias a <a href='https://www.instagram.com/niupleis'>mi Instagram</a>; me pongo vidios de youtube o música y trabajo en mi computadora, puedo estar por horas, me concentro y avanzo en mis proyectos.</p><p>Principalmente he estado trabajando en uno de mis juegos, quizás publique sobre eso pronto o quizás haga un video para youtube. También he estado resolviendo algo para un cliente, eso me ha distraido un poco pero ya he terminado. Estoy planeando otro proyecto de desarrollo, no devería porque me quitará tiempo pero es por un bien mayor, lo juro. No he tocado el tema de Punk Suteki, tnkii y niupleis.com en realidad, pero mañana mismo me comprometo a hacerlo. Tengo que poner en orden otras cosas que ya he mencionado en otros posts, y cuando lo haga, oh niña, vamos a despegar.</p><p>Como sea, tengo que ponerme al dia con algunas cosas, las vacaciones fueron deprimentes así que quiero reuperar un poco de moral ahora; siento que voy por buen camino, mientras tanto sigan <a href='https://www.instagram.com/niupleis'>mi Instagram</a>, <a href='https://x.com/ido1_wannabe'>mi twitter</a> y <a href='https://youtube.com/@idol_wannabe'>mi youtube</a> por que planeo actualizar allí pronto.<br>Adios!!!</p>"
}