{
	"id": "240929",
	"type": "dev",
	"langs": "[한국어][日本語][ESP][ENG]",
	"color": "#ff822e",
	"date": "29 de Septiembre de 2024",
	"title": "Stellario - Devlog 1",
	"summary": "Primera demo de Stellario",
	"content": "<p>Devlog anterior: <a href=\"https://blog.niupleis.com/entries/entry.html?id=240824\">Stellario - Devlog 0</a></p><p>Este es devlog 1 donde veremos como llegue a tener esta demo.</p><img src=\"images/240929_stellarioDemoGameplay.webp\"><p>Mi objetivo es lago así como shoot em' up que es necesito una nave y enemigos, algunos niveles, distintas naves y armas, jefes y una historia...<br>En el devlog anterior solo tenia algunos elementos de prueba y el único que dejé en esta demo es el de la nave.</p><p>Es un buen inicio, lo siguiente fué un enemigo. También añadí dos proyectiles, uno para la nave y otro para el enemigo.</p><img src=\"images/240929_shipAndEnemy.jpg\"><p>También les asigné un valor de \"Vida\" a cada uno, la capacidad de recibir daño. Esto les dá a ambos la capacidad de morir y la habilidad de asesinar.</p><img src=\"images/240929_murderSnippet.jpg\"><p>Agregué una pantalla de perder, una de ganar y una de inicio.</p><img src=\"images/240929_screens.jpg\"><p>Como pueden ver, es lo más básico de lo básico, pero ya se siente como un juego. La nave se mueve, los enemigos atacan y hay una sensación de reto, aunque sea muy simple. Todavía falta muchísimo por hacer, pero esto ya es un punto de partida sólido. </p><img src=\"images/240929_gameplay1.webp\"><img src=\"images/240929_gameplay2.webp\"><p>Ahora que tengo esta base, puedo empezar a iterar y agregar las cosas que realmente harán que Stellario se destaque: Las waifus, los jefes, las armas especiales, y la historia que quiero contar. Pero por ahora, esto es lo que hay. Así que, en los próximos devlogs, veremos cómo añado nuevos elementos y mecánicas, y cómo voy dando forma a este proyecto. También quiero compartir algunos de los retos que enfrento como desarrollador indie, porque no todo es tan fácil como parece.</p><p>Como sea, Aunque el juego es para movil, esta demo está disponible para probar en PC, puedes descaragarla <a href=\"https://niupleis.com/Stellario\" target=\"_blank\">aquí</a>.</p><p>Gracias por leer, Hasta luego!</p>"
}